backend/tests/jmeter-report/statistics.json
{
  "Get Billing Stats" : {
    "transaction" : "Get Billing Stats",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3696.4951111111177,
    "medianResTime" : 3077.0,
    "minResTime" : 1.0,
    "maxResTime" : 17645.0,
    "pct1ResTime" : 4847.4,
    "pct2ResTime" : 15501.900000000005,
    "pct3ResTime" : 16870.92,
    "throughput" : 4.555817880674018,
    "receivedKBytesPerSec" : 7.084474766084061,
    "sentKBytesPerSec" : 1.9219856684093513
  },
  "Top Properties by Revenue" : {
    "transaction" : "Top Properties by Revenue",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3819.616,
    "medianResTime" : 3987.5,
    "minResTime" : 118.0,
    "maxResTime" : 8326.0,
    "pct1ResTime" : 5260.9,
    "pct2ResTime" : 5454.85,
    "pct3ResTime" : 6333.35,
    "throughput" : 2.5250867367294068,
    "receivedKBytesPerSec" : 6.33485080525016,
    "sentKBytesPerSec" : 1.1121231623681274
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 9375,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5051.5989333333555,
    "medianResTime" : 4383.0,
    "minResTime" : 1.0,
    "maxResTime" : 19396.0,
    "pct1ResTime" : 8803.0,
    "pct2ResTime" : 9767.0,
    "pct3ResTime" : 16380.919999999998,
    "throughput" : 37.86914845918009,
    "receivedKBytesPerSec" : 121.98838890883331,
    "sentKBytesPerSec" : 12.880934442697415
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 3625,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6978.990068965524,
    "medianResTime" : 7018.0,
    "minResTime" : 193.0,
    "maxResTime" : 19396.0,
    "pct1ResTime" : 9707.4,
    "pct2ResTime" : 10316.099999999999,
    "pct3ResTime" : 17703.759999999984,
    "throughput" : 14.64350636235104,
    "receivedKBytesPerSec" : 23.00918138381135,
    "sentKBytesPerSec" : 3.4177715044940413
  },
  "Get Users List" : {
    "transaction" : "Get Users List",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3476.4070000000056,
    "medianResTime" : 3487.0,
    "minResTime" : 8.0,
    "maxResTime" : 10166.0,
    "pct1ResTime" : 5148.8,
    "pct2ResTime" : 5379.0,
    "pct3ResTime" : 5853.67,
    "throughput" : 8.091793303231862,
    "receivedKBytesPerSec" : 25.705620180325614,
    "sentKBytesPerSec" : 3.3979210160055673
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6926.610000000004,
    "medianResTime" : 7576.0,
    "minResTime" : 57.0,
    "maxResTime" : 18730.0,
    "pct1ResTime" : 10054.5,
    "pct2ResTime" : 11838.549999999994,
    "pct3ResTime" : 17133.47000000001,
    "throughput" : 3.8485814128912086,
    "receivedKBytesPerSec" : 6.047233880216752,
    "sentKBytesPerSec" : 0.8982528883603503
  },
  "Get Billing Records" : {
    "transaction" : "Get Billing Records",
    "sampleCount" : 1125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3292.467555555557,
    "medianResTime" : 3232.0,
    "minResTime" : 5.0,
    "maxResTime" : 10578.0,
    "pct1ResTime" : 5055.599999999999,
    "pct2ResTime" : 5330.700000000001,
    "pct3ResTime" : 6592.46,
    "throughput" : 4.551431172246384,
    "receivedKBytesPerSec" : 53.608166816273894,
    "sentKBytesPerSec" : 1.9201350257914431
  },
  "City-wise Revenue" : {
    "transaction" : "City-wise Revenue",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3742.7819999999992,
    "medianResTime" : 3915.0,
    "minResTime" : 138.0,
    "maxResTime" : 7233.0,
    "pct1ResTime" : 5136.6,
    "pct2ResTime" : 5307.75,
    "pct3ResTime" : 5560.99,
    "throughput" : 2.4805155503519853,
    "receivedKBytesPerSec" : 5.508430497194537,
    "sentKBytesPerSec" : 1.075536039410431
  }
}